In [1]:
import pandas as pd

**Q1. List any five functions of the pandas library with execution.**

In [2]:
data = data = {
    'Name' : ['Alice', 'Bob', 'Claire'],
    'Age' : [25, 30, 27],
    'Gender' : ['Female', 'Male', 'Female']
}

df = pd.DataFrame(data)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

A1.

### .head()

In [3]:
df.head()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### .tail()

In [4]:
df.tail()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### .max()

In [5]:
df.max()

Name      Claire
Age           30
Gender      Male
dtype: object

### .sort_values()

In [6]:
df.sort_values(by= 'Age', ascending= False)

     Name  Age  Gender
1     Bob   30    Male
2  Claire   27  Female
0   Alice   25  Female

### .info()

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Gender  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

**Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.**

In [8]:
data = {
    'A' : [i for i in range(10, 60, 10)],
    'B' : [i for i in range(60, 110, 10)],
    'C' : [i for i in range(110, 160, 10)]
}

df = pd.DataFrame(data)
df

    A    B    C
0  10   60  110
1  20   70  120
2  30   80  130
3  40   90  140
4  50  100  150

In [9]:
df.index = [i for i in range(1, 2*len(df)+1, 2)]

In [10]:
df

    A    B    C
1  10   60  110
3  20   70  120
5  30   80  130
7  40   90  140
9  50  100  150

**Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.**

**For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.**

In [11]:
data = {
    'Values' : [10, 20, 30, 40, 50]
}

df = pd.DataFrame(data)

In [12]:
def add_three(df):
    sum_three =df['Values'].iloc[0:3].sum()
    print(sum_three)

In [13]:
add_three(df)

60

**Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.**

In [14]:
data = {
    'Text': [
        'The cat sat on the mat.',
        'It is a sunny day today.',
        'Python is a versatile language.',
        'I love to read books.',
        'Data science is fascinating.'
    ]
}

df = pd.DataFrame(data)

In [15]:
df['Word_Count'] = df['Text'].map(lambda x: len(x.split()))

In [16]:
df

                              Text  Word_Count
0          The cat sat on the mat.           6
1         It is a sunny day today.           6
2  Python is a versatile language.           5
3            I love to read books.           5
4     Data science is fascinating.           4

**Q5. How are DataFrame.size() and DataFrame.shape() different?**

A5.
The methods DataFrame.size and DataFrame.shape in Pandas are used to retrieve information about the dimensions of a DataFrame, but they provide different details.

1. **DataFrame.size**
- Description: Returns the total number of elements in the DataFrame.
- Type: Integer.
- Calculation: It is calculated as the product of the number of rows and columns.
- Example Usage: To get the total number of elements.

2. **DataFrame.shape**
- Description: Returns a tuple representing the dimensions of the DataFrame.
- Type: Tuple (number of rows, number of columns).
- Example Usage: To get the dimensions (shape) of the DataFrame.

**Q6. Which function of pandas do we use to read an excel file?**

A6.
To read an Excel file into a Pandas DataFrame, you use the pd.read_excel() function. This function is part of the Pandas library and allows you to load data from Excel files (both .xls and .xlsx formats) into a DataFrame for further analysis.

**pd.read_excel('path_to_file.xlsx')**

**Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.**

**The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.**

In [17]:
data = {
    'Email': [
        'alice@example.com',
        'bob.smith@example.org',
        'charlie.brown@example.net',
        'david.jones@example.edu',
        'eve.green@example.co'
    ]
}

df = pd.DataFrame(data)
df

                       Email
0          alice@example.com
1      bob.smith@example.org
2  charlie.brown@example.net
3    david.jones@example.edu
4       eve.green@example.co

In [18]:
def find_username(df):
    df['Username'] = df['Email'].map(lambda x: x.split('@')[0])
    return df

In [19]:
find_username(df)

                       Email       Username
0          alice@example.com          alice
1      bob.smith@example.org      bob.smith
2  charlie.brown@example.net  charlie.brown
3    david.jones@example.edu    david.jones
4       eve.green@example.co      eve.green

**Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.**

In [20]:
data = {
    'A' : [3, 8, 6, 2, 9],
    'B' : [5, 2, 9, 3, 1],
    'C' : [1, 7, 4, 5, 2]
}

df = pd.DataFrame(data)
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [21]:
def filter_rows(df):
    new_df = df[(df['A'] > 5) & (df['B'] < 10)]
    return new_df

In [22]:
filter_rows(df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

**Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.**

In [23]:
data = {
    'Values' : [10, 20, 30, 40, 50, 50]
}

df = pd.DataFrame(data)
df

   Values
0      10
1      20
2      30
3      40
4      50
5      50

In [24]:
def stats_calc(df):
    mean = df['Values'].mean()
    mode = df['Values'].mode()
    median = df['Values'].median()
    std = df['Values'].std()
    print(f'Mean: {mean}\nMode: {mode}\nMedian: {median}\nStandard Deviation: {std}')

In [25]:
stats_calc(df)

Mean: 33.333333333333336
Mode: 0    50
Name: Values, dtype: int64
Median: 35.0
Standard Deviation: 16.32993161855452

**Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.**

In [26]:
data = {
    'Date': pd.date_range(start='2024-01-01', periods=10, freq='D'),
    'Sales': [100, 150, 200, 250, 300, 350, 400, 450, 500, 550]
}

df = pd.DataFrame(data)
df

        Date  Sales
0 2024-01-01    100
1 2024-01-02    150
2 2024-01-03    200
3 2024-01-04    250
4 2024-01-05    300
5 2024-01-06    350
6 2024-01-07    400
7 2024-01-08    450
8 2024-01-09    500
9 2024-01-10    550

In [27]:
def moving_avg(df):
    df['MovingAverage'] = df['Sales'].rolling(window= 7, min_periods=1).mean()
    return df

In [28]:
moving_avg(df)

        Date  Sales  MovingAverage
0 2024-01-01    100          100.0
1 2024-01-02    150          125.0
2 2024-01-03    200          150.0
3 2024-01-04    250          175.0
4 2024-01-05    300          200.0
5 2024-01-06    350          225.0
6 2024-01-07    400          250.0
7 2024-01-08    450          300.0
8 2024-01-09    500          350.0
9 2024-01-10    550          400.0

**Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.**

In [29]:
data = {
    'Date': pd.date_range(start='2023-01-01', periods=5, freq='D')
}

df = pd.DataFrame(data)
df

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [30]:
def weekday_col(df):
    df['Date'] = pd.to_datetime(df['Date'])
    df['Weekday'] = df['Date'].dt.day_name()
    return df

In [31]:
weekday_col(df)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

**Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.**

In [32]:
data = {
    'Date': ['2023-01-01', '2023-01-15', '2023-02-01', '2023-01-31', '2023-03-01'],
    'Value': [10, 20, 30, 40, 50]
}

df = pd.DataFrame(data)
df

         Date  Value
0  2023-01-01     10
1  2023-01-15     20
2  2023-02-01     30
3  2023-01-31     40
4  2023-03-01     50

In [33]:
def filter_dates(df):
    df['Date'] = pd.to_datetime(df['Date'])
    new_df = df[(df['Date'] >= '2023-01-01') & (df['Date'] <= '2023-01-31')]
    return new_df

In [34]:
filter_dates(df)

        Date  Value
0 2023-01-01     10
1 2023-01-15     20
3 2023-01-31     40

**Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?**

A12.

To use the basic functions of pandas, the first and foremost library that needs to be imported is pandas itself. Typically it is imported with the common alias pd:

In [35]:
import pandas as pd